#language: ru
Функционал: Наушники

  Сценарий: Проверка поиска наушников на Яндекс
    И перейти в "Яндекс.Маркет"
    И выбрать раздел "Электроника"
    И выбрать раздел "Наушники"
    И зайти в расширенный поиск. кнопка "Все фильтры"
    И для поля "Цена От" задать параметр поиска "5000"
    И нажимается на кнопку "Показать ещё"
    И выбрать производителя "Beats"
    И нажать кнопку Показать предложения
    И проверить, что элементов на странице 29
    И запомнить первый элемент в списке
    И ввести запомненное значение в "Строка поиска"
    И нажимается на кнопку Найти
    И проверить, что наименование товара соответствует запомненному значению.