#language: ru
Функционал: Телевизоры

  Сценарий: Проверка поиска телевизоров на Яндекс
    И перейти в "Яндекс.Маркет"
    И выбрать раздел "Электроника"
    И выбрать раздел "Телевизоры"
    И зайти в расширенный поиск. кнопка "Все фильтры"
    И для поля "Цена От" задать параметр поиска "20000"
    И выбрать производителя "Samsung"
    И выбрать производителя "LG"
    И нажать кнопку Показать предложения
    И проверить, что элементов на странице 48
    И запомнить первый элемент в списке
    И ввести запомненное значение в "Строка поиска"
    И нажимается на кнопку Найти
    И проверить, что наименование товара соответствует запомненному значению.